app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "sdffds"], ["text", "fdsaf"], ["created_at", "2018-12-16 20:36:20.850810"], ["updated_at", "2018-12-16 20:36:20.850810"]]