app/controllers/mail_controller.rb

SELECT "mails".* FROM "mails"
---
  def index
    @mails = Mail.all

INSERT INTO "mails" ("from", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["from", "edsv"], ["created_at", "2018-12-17 22:23:30.612086"], ["updated_at", "2018-12-17 22:23:30.612086"]]
---
  def create
    return unless params.key?(:mail)

    email = params.fetch(:mail)
    Mail.create(
      from: email.fetch(:from), to: email.fetch(:to),
      title: email.fetch(:title), message: email.fetch(:message)
    )

DELETE FROM "mails" WHERE "mails"."id" = $1  [["id", 4]]
SELECT  "mails".* FROM "mails" WHERE "mails"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def destroy
    Mail.find_by(id: params.fetch(:id)).destroy