app/controllers/message_controller.rb

  def create
    @message = Message.new
    @message.text = params[:message]['text']
    @message.from = params[:message]['from']
    @message.to = params[:message]['to']
    # abort @subject.inspect
    if @message.save
---
INSERT INTO "messages" ("text", "from", "to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "asdfasdfasdfa"], ["from", 1], ["to", 1], ["created_at", "2018-12-03 21:07:03.446716"], ["updated_at", "2018-12-03 21:07:03.446716"]]

  def fetchAll
    render json: Message.find_each
---
SELECT  "messages".* FROM "messages" ORDER BY "messages"."id" ASC LIMIT $1  [["LIMIT", 1000]]