app/controllers/ssubjects_controller.rb

INSERT INTO "ssubjects" ("student_id", "subject_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 1], ["subject_id", 1], ["created_at", "2018-12-03 21:33:12.745068"], ["updated_at", "2018-12-03 21:33:12.745068"]]
---
  def create
    @ss = Ssubjects.new
    @ss.student_id = params[:ssubject]['student_id']
    @ss.subject_id = params[:ssubject]['subject_id']
    # abort @subject.inspect
    if @ss.save

SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."id" ASC LIMIT $1  [["LIMIT", 1000]]
SELECT  "ssubjects".* FROM "ssubjects" ORDER BY "ssubjects"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  def fetchAll
    render json: Ssubjects.find_each