app/controllers/subject_controller.rb

  def create
    parameters = params[:subject] # rubocop Assignment Branch Condition size err
    @subject = Subject.new
    assign(parameters)
    if @subject.save
      render json: Subject.find_by(teacher_id: parameters['id']), status: 200
---
INSERT INTO "subjects" ("name", "time", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dsaf"], ["time", "08:15"], ["teacher_id", 1], ["created_at", "2018-12-03 20:20:41.346243"], ["updated_at", "2018-12-03 20:20:41.346243"]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."teacher_id" = $1 LIMIT $2  [["teacher_id", 1], ["LIMIT", 1]]

  def delete
    @subject = Subject.destroy(params.fetch(:subject).fetch('id'))
---
DELETE FROM "subjects" WHERE "subjects"."id" = $1  [["id", 2]]

  def fetch_all
    render json: Subject.find_each
---
SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."id" ASC LIMIT ?  [["LIMIT", 1000]]