app/controllers/ticket_controller.rb

INSERT INTO "tickets" ("ticket", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["ticket", "sdaf"], ["created_at", "2018-12-17 22:07:32.951770"], ["updated_at", "2018-12-17 22:07:32.951770"]]
---
  def create
    Ticket.create(ticket: params.fetch(:ticket).fetch(:ticket)) if params.key?(:ticket)

DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 4]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."ticket" = $1 LIMIT $2  [["ticket", "dsf"], ["LIMIT", 1]]
---
  def destroy
    Ticket.find_by(ticket: params.fetch(:ticket)).destroy