app/controllers/user_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "password", "age", "token", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "jonas@gmail.com"], ["password", "jonas"], ["LIMIT", 1]]
---
  def register
    @user = User.new
    @user.name = params[:user]['name']
    @user.last_name = params[:user]['last_name']
    @user.email = params[:user]['email']
    @user.password = params[:user]['password']
    @user.age = params[:user]['age']
    @user.role = params[:user]['role']
    @user.token = Digest::MD5.new.hexdigest(params[:user]['email'])
    if @user.save
      render json: User.find_by(
        email: params[:user]['email'],
        password: params[:user]['password']
      ), status: 200

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "j"], ["password", "j"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:user]['email'], password: params[:user]['password'])